{
  "Our Product": "منتجاتنا",
  "Gallery": "معرض",
  "Free Estimate": "تصاميم مجانية",
  "Looking for a Dust-Free, Quiet, Cool, and Elegant Home Interior?": "هل تبحث عن حلول لمنزل احلامك بأن يكون خالي من الغبار، هادئ، بارد، وأنيق؟",
  "Discover": "يكتشف",
  "Keystone uPVC&rsquo;s": "كيستون يو بي في سي",
  "Premium uPVC Windows and Doors Solutions.": "حلول النوافذ والأبواب المتميزة ",
  "Achieve Your Dream Home Environment by Leveraging Our Expertise in German-Engineered uPVC Windows and Doors.": "حقق بيئة منزلك المثالية بالاستفادة من خبرتنا في تصنيع نوافذ وأبواب يو بي في سي الألمانية المصدر ",
  "Enjoy a Sand and Dust-Free Environment": "ضمان الإغلاق المحكم ضد الماء",
  "Benefit from Superior Thermal and Heat Insulation": "استفد من العزل الحراري  الفائق",
  "Experience Waterproof and Airtight Protection": "استمتع ببيئة خالية من الغبار",
  "Near to Zero Maintainence": "امكانيات عزل  استثنائية للحد من الضوضاء",
  "Exceptional Noise Reduction Capabilities": "الحاجة للصيانة قد تكون معدومة",
  "Request Your Free Estimate Today": "اطلب تصاميم مجانية الان",
  "No Obligations • Hassle-Free Experience": "تعرف على المزيد  - و بدون التزامات",
  "Multi-chambered profiles: Schüco uPVC window and door profiles are designed with multiple chambers that help to absorb and dissipate sound, creating an effective barrier against external noise.": "مقاطع جانبية متعددة الغرف: تم تصميم مقاطع النوافذ والأبواب Schüco uPVC بغرف متعددة تساعد على امتصاص الصوت وتبديده، مما يخلق حاجزًا فعالًا ضد الضوضاء الخارجية.",
  "Tight sealing: Schüco uPVC windows and doors are equipped with advanced sealing systems, including EPDM gaskets, that ensure airtight closure. This prevents sound from passing through gaps between the window or door and the frame.": "إحكام الغلق: تم تجهيز نوافذ وأبواب Schüco uPVC بأنظمة إحكام متقدمة، بما في ذلك حشوات EPDM، التي تضمن إغلاقًا محكمًا. وهذا يمنع الصوت من المرور عبر الفجوات بين النافذة أو الباب والإطار.",
  "Double glazing: Schüco uPVC windows and doors can be fitted with double-glazed glass, which significantly reduces noise transmission. The space between the glass panes acts as an insulating barrier that absorbs sound energy.": "الزجاج المزدوج: يمكن تجهيز نوافذ وأبواب Schüco uPVC بزجاج مزدوج، مما يقلل بشكل كبير من انتقال الضوضاء. تعمل المسافة بين الألواح الزجاجية كحاجز عازل يمتص الطاقة الصوتية.",
  "High-performance glass: Using acoustic or laminated glass with Schüco uPVC windows and doors can further enhance their noise reduction capabilities. These types of glass are specifically designed to minimize sound transmission.": "زجاج عالي الأداء: يمكن أن يؤدي استخدام الزجاج الصوتي أو الزجاج الرقائقي مع نوافذ وأبواب Schüco uPVC إلى تعزيز قدراتها على تقليل الضوضاء. تم تصميم هذه الأنواع من الزجاج خصيصًا لتقليل نقل الصوت.",
  "Schüco uPVC windows and doors contribute to noise reduction through their excellent design and use of high-quality materials. Here are some factors that make them effective at reducing noise:": "تساهم نوافذ وأبواب Schüco uPVC في تقليل الضوضاء من خلال تصميمها الممتاز واستخدام مواد عالية الجودة. فيما يلي بعض العوامل التي تجعلها فعالة في تقليل الضوضاء:",
  "By incorporating these features, Schüco uPVC windows and doors effectively reduce noise levels in your home, providing a quieter and more comfortable living environment.": "من خلال دمج هذه الميزات، تعمل نوافذ وأبواب Schüco uPVC على تقليل مستويات الضوضاء في منزلك بشكل فعال، مما يوفر بيئة معيشية أكثر هدوءًا وراحة.",
  "How do Schüco uPVC windows and doors contribute to noise reduction?": "كيف تساهم نوافذ وأبواب Schüco uPVC في تقليل الضوضاء؟",
  "Keystone uPVC Windows & Doors": "كيستون للنوافذ والأبواب الـ uPVC",
  "Keystone uPVC Windows & Doors offers premium quality solutions for your home. Achieve elegance, durability, and energy efficiency with our German-engineered products.": "تقدم Keystone uPVC Windows & Doors حلولاً عالية الجودة لمنزلك. حقق الأناقة والمتانة وكفاءة الطاقة مع منتجاتنا ذات الهندسة الألمانية.",
  "© 2024 Keystone uPVC. All Rights Reserved.": "© 2024 كيستون uPVC. جميع الحقوق محفوظة.",
  "Quick Links": "روابط سريعة",
  "Home": "بيت",
  "Follow Us": "تابعنا",
  "Enhanced Durability & Longevity": "متانة مضاعفة لسنوات طويلة  ",
  "Energy Efficiency & Savings": "كفاءة استهلاك وتوفير الطاقة",
  "Secure Locking Mechanisms": "آليات القفل الآمنة",
  "Premium Schuco Profiles": "مقاطع شوكو المتميز ة",
  "Customizable Design Options": "خيارات التصميم حسب ذوق العميل ",
  "High-Performance Sealing Systems": "أنظمة العزل عالية الأداء",
  "Our Story": "قصتنا",
  "In the early 1990s, the inception of our company was rooted in a personal experience. The founder, while selecting windows for his first home, was not guided by quality standards or specifications. This led to a series of issues, including poor insulation against heat, dust, and noise. The shortcomings of these windows were felt deeply by the founder and his family.": "في أوائل التسعينيات، كانت بداية شركتنا متجذرة في تجربة شخصية. المؤسس أثناء اختياره للنوافذ لمنزله الأول، لم يسترشد بمعايير الجودة أو المواصفات. وأدى ذلك إلى سلسلة من المشاكل، بما في ذلك ضعف العزل ضد الحرارة والغبار والضوضاء. لقد شعر المؤسس وعائلته بعمق بأوجه القصور في هذه النوافذ.",
  "Inspired by his personal journey and the transformation he experienced, the founder took a leap in 2019. He established Keystone uPVC windows with a clear objective in mind - to provide his fellow citizens with superior quality windows and doors. His mission was to answer a crucial question that arises when building a dream home:": "لكن عند بناء منزله الثالث في عام 2019 ولثقته الكاملة بنوافذ ال uPVC الالمانية المصدر قرر انشاء شركة كيستون لنوافذ ال uPVC وهدفه توفير الأفضل وكذلك مساعدة اخوانه المواطنين في الإجابة على سؤال قد يخطر على بال كل من يبني منزل احلامه:",
  "How can I make the interiors of my home dust-free, quiet, cool, and elegant?": "كيف يمكنني أن اجعل البيئة الداخلية لمنزلي الجديد باردة، خالية من الغبار، هادئة، وأنيقة؟",
  "This question is not just about aesthetics or comfort. It's about creating a nurturing environment where our children can grow, and where families can spend quality time together. The importance of choosing the right windows is a key step in achieving this goal.": "يجب ان يكون هذا هو هدفنا عند بناء منزل سينمو فيه أطفالنا ونقضي فيه أكثر واروع اوقاتنا مع العائلة. ولتحقيق هذا الهدف يجب ان لا نقلل من أهمية النافذة كعنصر أساسي من مكونات منزلنا.",
  "If you're visiting our website, it means you share this goal. You're on the right track to achieving it. Let us guide you in choosing the best windows and doors for your home.": "إذا كنت تزور موقعنا، فهذا يعني أنك تشارك هذا الهدف. أنت على الطريق الصحيح لتحقيق ذلك. دعنا نرشدك في اختيار أفضل النوافذ والأبواب لمنزلك.",
  "Here&rsquo;s how:": "وإليك الطريقة:",
  "1. Opt for uPVC Windows Over Aluminum for": "واحد. اختر نوافذ uPVC بدلًا من الألومنيوم",
  "Improved Performance and Aesthetics.": "تحسين الأداء والجماليات.",
  "2. Choose only the best German brands": "إثنان. اختر فقط أفضل العلامات التجارية الألمانية",
  "making uPVC windows.": "صنع نوافذ uPVC.",
  "3. Know how to evaluate proposals from uPVC windows fabricators offering German brands and how to identify the best brand.": "ثلاثة. معرفة كيفية تقييم العروض المقدمة من مصنعي نوافذ uPVC الذين يقدمون علامات تجارية ألمانية وكيفية تحديد أفضل علامة تجارية.",
  "Fast forward to 2010, while planning his second villa, the founder made a pivotal decision. He chose German uPVC windows and doors over the typical aluminum windows. This choice was not only aesthetically pleasing, adding a touch of elegance to the villa, but it also significantly improved the comfort of the home. The insulation quality of these German uPVC windows and doors far surpassed that of the locally made aluminum or uPVC counterparts.": "وبالمضي قدمًا إلى عام 2010، أثناء تخطيط الفيلا الثانية، اتخذ المؤسس قرارًا محوريًا. لقد اختار نوافذ وأبواب uPVC الألمانية على نوافذ الألمنيوم النموذجية. لم يكن هذا الاختيار ممتعًا من الناحية الجمالية فحسب، بل أضاف لمسة من الأناقة إلى الفيلا، ولكنه أدى أيضًا إلى تحسين راحة المنزل بشكل كبير. جودة العزل لنوافذ وأبواب الـ uPVC الألمانية تفوق بكثير جودة نظيراتها المصنوعة من الألومنيوم أو الـ uPVC المصنوعة محليًا.",
  "Opt for uPVC Windows Over Aluminum for Improved Performance and Aesthetics.": "اختر نوافذ uPVC على الألومنيوم الدارج والمحلي الصنع لتحسين الأداء وإثراء الرونق الجميل لبيتك.",
  "Choose Only the Finest German Brands Crafting High-Quality uPVC Windows.": "اختر فقط أفضل العلامات التجارية الألمانية التي تصنع نوافذ uPVC عالية الجودة.",
  "Master the Art of Evaluating Proposals from uPVC Fabricators and Identifying the Best Brands in the Market.": "حاول إتقان فن تقييم العروض المقدمة من مصنعي uPVC حيث ليس كل العروض الفنية متساوية فيما تقدمة من قيمة مقابل السعر.",
  "Selecting the Ideal Window Solution for Your Home": "اختيار الحل الأمثل لنوافذ منزلك",
  "When selecting windows for your new home, it's important to consider the materials used in their construction. One popular choice is uPVC windows, which offer several advantages over traditional aluminum windows. Here are some reasons why you should choose uPVC windows instead of aluminum:": "عند اختيار النوافذ لمنزلك الجديد، من المهم أن تأخذ في الاعتبار المواد المستخدمة في بنائها. أحد الخيارات الشائعة هي نوافذ uPVC، والتي توفر العديد من المزايا مقارنة بنوافذ الألومنيوم التقليدية. فيما يلي بعض الأسباب التي تجعلك تختار نوافذ uPVC بدلاً من الألومنيوم:",
  "uPVC Windows Are…": "نوافذ uPVC هي…",
  "the Best for Home Insulation": "الحل الامثل للعزل الحراري",
  "Energy efficiency is crucial in today's world. By choosing the right uPVC windows, you can significantly improve your home's insulation, leading to reduced heat transfer and enhanced energy efficiency": "تعد كفاءة الطاقة أمرًا بالغ الأهمية في عالم اليوم. فمن خلال اختيار نوافذ uPVC المناسبة، يمكنك تحسين عزل منزلك بشكل كبير، مما يؤدي إلى تقليل نقل الحرارة ويحافظ على منزلك باردًا في الصيف ويعزز من كفاءة الطاقة.",
  "Enjoy a more comfortable living environment while potentially saving money on energy bills": "اذاً، استمتع ببيئة معيشية أكثر راحة مع توفير المال على فواتير الطاقة.",
  "Your Noise Reduction Solution": "الحل الامثل لعزل الصوت",
  "uPVC windows offer excellent soundproofing properties, helping to reduce outside noise and create a tranquil indoor environment especially if you live near a busy road or in an area with high levels of noise pollution.": "توفر نوافذ uPVC خصائص ممتازة لعزل الصوت ، مما يساعد على تقليل الضوضاء الخارجية وخلق بيئة داخلية هادئة خاصةً إذا كنت تعيش بالقرب من طريق مزدحم أو في منطقة ذات مستويات عالية من التلوث الضوضائي.",
  "A peaceful and quiet home is essential for relaxation and well-being": "اخلق جوًا هادئًا في منزلك، وعزز الاسترخاء والرفاهية",
  "Your Low Maintenance Solution": "حل الصيانة المنخفضة الخاص بك:",
  "Reducing the time and effort spent on maintaining your windows is a great advantage. uPVC windows offer minimal maintenance requirements compared to aluminum windows, making them a smart and convenient choice for homeowners.": "يعد تقليل الوقت والجهد المبذولين في صيانة النوافذ ميزة رائعة. توفر نوافذ uPVC الحد الأدنى من متطلبات الصيانة مقارنة بنوافذ الألومنيوم ، مما يجعلها خيارًا ذكيًا ومريحًا لأصحاب المنازل.",
  "Easily keep your windows looking new with just a simple wipe down using a damp cloth": "اجعل النوافذ تبدو جديدة بمسحة بسيطة باستخدام قطعة قماش مبللة",
  "Your Durable Window Solution": "حل النوافذ الدائم لمنزل احلامك",
  "Durability is an essential factor when choosing windows for your home. uPVC windows are highly durable and long-lasting, making them a reliable and low-maintenance option for homeowners who value longevity and dependability": "المتانة عامل أساسي عند اختيار النوافذ لمنزلك. نوافذ uPVC متينة للغاية وطويلة الأمد، مما يجعلها خيارًا موثوقًا به وقليل الصيانة لأصحاب المنازل.",
  "Benefit from highly durable and long-lasting windows that withstand the test of time. Enjoy resistance to harsh weather conditions and extreme temperatures without warping or deterioration": "استفد من النوافذ شديدة التحمل والتي تصمد أمام اختبار الزمن بمقاومة الظروف الجوية القاسية ودرجات الحرارة القصوى دون التواء أو تغير في اللون.",
  "Choose a reliable and low-maintenance window option for your home, offering peace of mind and long-term value": "اختر نظام نوافذ موثوقًا به ومنخفض الصيانة لمنزلك، مما يوفر راحة البال وقيمة طويلة الأجل",
  "Not any uPVC": "ولكن ليس أي uPVC",
  "Choose only the best German brands making uPVC windows.": " اختر فقط الأفضل من العلامات التجارية الألمانية التي تصنع نوافذ ال uPVC والتي تتميز بعناصرها التالية:",
  "Choosing the best quality German uPVC windows and doors starts with understanding the criteria for your selection.": "اختيارك افضل نوع من نوافذ وابواب ال uPVC الالمانية يطلب معرفة آلية اختيار عناصرها",
  "PROFILE": "المقاطع",
  "STEEL": "حديد التسليح",
  "Make sure to select windows with profiles extruded in Germany from a special hot country compound and designed with 5 chambers to withstand the extreme weather conditions of the Gulf countries while maintaining its aesthetic nature.": "جودة العزل هو اهم ما يميز نوافذ ال uPVC الألمانية الصنع لأنها تٌشكل من مقاطع مصنوعة من تركيبة مواد مقاومة لنفاذ الهواء الحار الى داخل المنزل والهواء البارد الى خارجه. كما لها خاصية الاحتفاظ برونقها ولونها حتى تحت درجات حرارة ورطوبة عالية ولسنوات طويلة جدا.",
  "Only the profiles made in Germany have these characteristics.": "فقط المقاطع المصنوعة في المانيا لديها هذه الخواص.",
  "The strong, corrosion-protected steel profiles in the window frame and vents ensure stability, reliability, and longevity. Also, all the fittings are anchored securely and permanently in the steel reinforcement on all sides.": "تضمن التشكيلات الفولاذية القوية والمقاومة للتآكل في إطار النافذة وفتحات التهوية الاستقرار والموثوقية وطول العمر للنافذة. أيضًا، يتم تثبيت جميع التركيبات بشكل آمن ودائم في حديد التسليح من جميع الجوانب.",
  "HARDWARE": "نظام الغلق والفتح",
  "The hardware system must provide the best-in-class security and insulation for the windows. The hardware should give a wide variety of customization options for you, while keeping the windows looking sleek and modern.": "يجب أن يوفر نظام الغلق والفتح أفضل أمان وعزل للنوافذ. كما يجب أن يوفر لك هذا النظام مجموعة متنوعة من الخيارات، مع الحفاظ على النوافذ تبدو أنيقة وحديثة.",
  "ACCESSORIES": "الملحقات",
  "Window accessories should allow you to create individual design accents. You should be able to choose from a wide variety of accessory options to suit your vision, be it clean, linear design, or colorful accents.": "يجب أن تكون قادراً على الاختيار من بين مجموعة متنوعة من الملحقات التي تناسب ذوقك، سواء كانت بسيطة أو ذات تصميم خطي أو ملونة.",
  "Know how to evaluate proposals from uPVC windows fabricators offering German brands and how to identify the best brand.": "تعرف على كيفية تقييم العروض المقدمة من مصنعي نوافذ uPVC الذين يقدمون العلامات التجارية الألمانية وكيفية تحديد أيها الأفضل.",
  "Here You Go....": "اليك الأتي.....",
  "Go only for trusted German brands who offers durable, energy efficient and stylish products.": "ليكن هدفك اختيار فقط العلامات التجارية الألمانية الموثوقة لانها تقدم منتجات متينة وأنيقة وموفرة للطاقة.",
  "Make sure that the uPVC window entire system including the profiles, steel, hardware, accessories and EPDM gaskets are designed and manufactured by the same German supplier.": "تأكد من أن نظام نافذة uPVC بالكامل بما في ذلك المقاطع وحديد التسليح ونظام الغلق والفتح والملحقات وحشيات EPDM قد تم تصميمها وتصنيعها بواسطة نفس المورد الألماني.",
  "Make sure that the steel offered for the windows enforcement have the thickness that is appropriate for the size and use of the window or door and it covers the full profile length.": "تأكد من أن حديد التقوية المستخدم في نوافذ uPVC ذو سماكة تتناسب مع نوع حجم واستخدام النافذة او الباب ويغطي كامل المقطع و ان يكون ذو جودة عالية.",
  "Make sure that the glass used in the uPVC windows is high-performance, featuring a low U-value to match the thermal and insulation properties of the window system.": "تأكد من أن الزجاج المستخدم في نوافذ uPVC عالي الأداء، ويتميز بقيمة منخفضة لعامل ال U لمطابقة المعائير العالمية للخصائص الحرارية والعزل.",
  "The fabricator must have the capability and flexibility to align with your external and interiors design of your dream home.": "يجب أن يتمتع المُصنِّع بالقدرة والمرونة بعمل تصاميم تتوافق مع التصميم المعاري الخارجي والداخلي لمنزل أحلامك.",
  "You should always ask for detailed design drawings to confirm that the fabricator has selected the right profile, steel thickness, hardware, and accessories for your uPVC windows and doors. And all these components are made in Germany, only then you can guarantee that you are getting the right value for your money.": "يجب عليك دائمًا طلب رسومات التصميم التفصيلية لتأكيد أن المصنِّع قد اختار المظهر الجانبي الصحيح، وسُمك ونوع الفولاذ المناسب، ونظام الغلق والفتح الافضل، والملحقات الانيقة لنوافذ وأبواب uPVC وجميع هذه المكونات مصنوعة في ألمانيا، وعندها فقط يمكنك ضمان حصولك على القيمة الصحيحة مقابل نقودك.",
  "Also make sure that the detailed design drawings include the specifications of the glass stating the U value, thickness, and origin of the glass.": "كما يجب عليك ان تتأكد بان المخططات التفصيلية تشمل مواصفات الزجاج من حيث السماكة، وقيمة عامل ال U وبلد التصنيع.",
  "The fabricator must offer the best workmanship quality through trained professionals using the German machinery for making the highest quality uPVC windows and doors.": "يجب أن يقدم المُورد أفضل مصنعية من خلال مهنيين مدربين يستخدمون الآلات الألمانية لصنع نوافذ وأبواب uPVC بأعلى جودة.",
  "Why Choose ": "لماذا تختار ",
  "Schüco?": "شوكو؟",
  "By choosing Schüco you are getting everything from a single source": "عند اختيارك لشوكو، تحصل على كل شيء من مصدر واحد",
  "With windows, doors and sliding doors from Schüco, you have the freedom to design your home down to the last detail, whether it is a new build or a renovation or refurbishment project. Our products which includes the profile (Special hot country compound), steel, hardware and accessories offer quality, innovation and durability.": "مع النوافذ والأبواب والأبواب المنزلقة من شوكو، لديك الحرية في تصميم منزلك حتى آخر تفصيل، سواء كان مشروع بناء جديد أو مشروع تجد    يد أو ترميم. منتجاتنا التي تشمل البروفايل (مركب خاص للبلدان الحارة)، الحديد الصلب، انظمة الغلق والفتح والملحقات تقدم الجودة، الابتكار والمتانة.",
  "4 Great Reasons": "أربعة أسباب رائعة",
  "to choose Schüco windows, doors and sliding doors": "للاختيار نوافذ وأبواب وأبواب منزلقة من شوكو",
  "PASSION": "الشغف",
  "QUALITY": "الجودة",
  "CONFIDENCE": "الثقة",
  "INNOVATION": "الابتكار",
  "Know more about the products": "تعرف أكثر على منتجاتنا",
  "Windows": "النوافذ",
  "Doors": "أبواب",
  "Sliding Doors": "أبواب منزلقة",
  "Keystone uPVC?": "كيستون يو بي في سي؟",
  "When you choose to receive a quote from us, here's what you can expect:": "وإذا اخترت ان نقدم لك عرض أسعار فتوقع الاتي:",
  "We will provide you with suitable uPVC windows and doors from the German company Schüco. Schüco offers profiles, reinforcement steel, opening and closing systems, and accessories, ensuring quality, innovation, and durability.": "سنقدم لك ما يناسب منزلك من نوافذ وابواب uPVC من شركة Schüco الألمانية التي توفر المقاطع وحديد التقوية ونظام الغلق والفتح والملحقات مما يضمن لك الجودة والابتكار والمتانة.",
  "Our engineers will design windows and doors while considering the architectural aspects and interior designs of your dream home. We will present you with detailed plans and several options, giving you the freedom to design your home down to the finest details.": "سيقوم مهندسينا بتصميم النوافذ والابواب مع مراعاة الجانب المعماري والتصاميم الداخلية لبيت احلامك وستعرض لك المخططات التفصيلية مع عدة خيارات ليكون لديك الحرية في تصميم منزلك بأدق التفاصيل،",
  "We will show you all the components of our products, allowing you to see how these elements surpass their German counterparts.": "سنعرض لك جميع مكونات منتجاتنا من أبواب ونوافذ لتتأكد من مدى تفوق هذه العناصر على نظيراتها من المنتجات الالمانية.",
  "We will take you on a tour of our factory, where you can see the quality standards in the manufacturing of our products and the competence of our teams.": "سنقوم معك بجولة في مصنعنا لاطلاعك على معايير الجودة في تصنيع منتجاتنا وكفأه فرق العمل لدينا،",
  "Do I have to pay for the detailed design drawings?": "هل يجب علي أن أدفع مقابل رسومات التصميم التفصيلية؟",
  "No! you don't have to pay for the detailed design drawings, we provide them along with the proposal at no extra cost. Our aim is to keep you well-informed about the products and services you're opting for, so you can make a confident decision.": "لا! ليس عليك أن تدفع مقابل رسومات التصميم التفصيلية، فنحن نقدمها مع العرض دون أي تكلفة إضافية. هدفنا هو أن نبقيك على اطلاع جيد بالمنتجات والخدمات التي تختارها، حتى تتمكن من اتخاذ قرار واثق.",
  "How long is the typical lifespan of Schüco uPVC windows and doors?": "ما هو العمر الافتراضي النموذجي لنوافذ وأبواب Schüco uPVC؟",
  "The typical lifespan of Schüco uPVC windows and doors is quite impressive, lasting for 30 years or even longer with proper care and maintenance. Their high-quality materials and manufacturing processes ensure long-lasting durability and excellent performance, making them a reliable and cost-effective choice for your home.": "إن العمر الافتراضي النموذجي لنوافذ وأبواب Schüco uPVC مثير للإعجاب للغاية، حيث يدوم لمدة 30 عامًا أو حتى لفترة أطول مع الرعاية والصيانة المناسبة. تضمن المواد وعمليات التصنيع عالية الجودة متانة طويلة الأمد وأداء ممتاز، مما يجعلها خيارًا موثوقًا وفعالاً من حيث التكلفة لمنزلك.",
  "What type of glass is recommended for use with Schüco uPVC windows and doors?": "ما هو نوع الزجاج الموصى باستخدامه مع نوافذ وأبواب Schüco uPVC؟",
  "We always suggest and provide quotes for high-performance glass to be used with Schüco uPVC windows and doors, ensuring you achieve the desired thermal and sound insulation unattainable with standard glass. This approach eliminates the need for additional Low-E glass.": "نحن دائمًا نقترح ونقدم عروض أسعار للزجاج عالي الأداء لاستخدامه مع نوافذ وأبواب Schüco uPVC، مما يضمن حصولك على العزل الحراري والصوتي المطلوب الذي لا يمكن تحقيقه مع الزجاج القياسي. يلغي هذا الأسلوب الحاجة إلى زجاج منخفض الانبعاث إضافي.",
  "Do Schüco uPVC windows and doors require regular maintenance?": "هل تحتاج نوافذ وأبواب Schüco uPVC إلى صيانة دورية؟",
  "Schüco uPVC windows and doors are known for their low-maintenance requirements. Unlike materials like aluminum, which can suffer from oxidation and corrosion over time, uPVC is highly resistant to weathering and does not corrode or degrade. This makes it an ideal choice for long-lasting, hassle-free windows and doors.": "تشتهر نوافذ وأبواب Schüco uPVC بمتطلبات الصيانة المنخفضة. على عكس المواد مثل الألومنيوم، التي يمكن أن تعاني من الأكسدة والتآكل بمرور الوقت، فإن الـ uPVC مقاوم للغاية للعوامل الجوية ولا يتآكل أو يتحلل. وهذا يجعله خيارًا مثاليًا للنوافذ والأبواب طويلة الأمد والخالية من المتاعب.",
  "However, to keep your Schüco uPVC windows and doors functioning smoothly and looking their best, some basic maintenance is recommended:": "ومع ذلك، للحفاظ على عمل نوافذ وأبواب Schüco uPVC بسلاسة والمظهر بأفضل حالاتها، يوصى ببعض أعمال الصيانة الأساسية:",
  "Cleaning: Periodically clean the window and door frames with a soft cloth and mild soapy water to remove dirt and grime. Avoid using abrasive cleaners or harsh chemicals that can damage the uPVC surface.": "التنظيف: قم بتنظيف إطارات النوافذ والأبواب بشكل دوري بقطعة قماش ناعمة وماء وصابون معتدل لإزالة الأوساخ والأوساخ. تجنب استخدام المنظفات الكاشطة أو المواد الكيميائية القاسية التي يمكن أن تلحق الضرر بسطح الـ uPVC.",
  "Glass care: Clean the glass panes with a soft cloth and a glass cleaner to maintain their clarity and appearance.": "العناية بالزجاج: قم بتنظيف الألواح الزجاجية بقطعة قماش ناعمة ومنظف زجاج للحفاظ على نقاءها ومظهرها.",
  "By following these simple maintenance steps, you can ensure that your Schüco uPVC windows and doors remain in excellent condition for many years.": "باتباع خطوات الصيانة البسيطة هذه، يمكنك التأكد من بقاء نوافذ وأبواب Schüco uPVC في حالة ممتازة لسنوات عديدة.",
  "How do I know that the fabricator is using genuine Schüco components in my uPVC windows and doors?": "كيف أعرف أن المُصنع يستخدم مكونات Schüco الأصلية في نوافذ وأبواب uPVC الخاصة بي؟",
  "To ensure that the fabricator is using genuine Schüco components in your uPVC windows and doors, you can follow these steps:": "للتأكد من أن المُصنع يستخدم مكونات Schüco الأصلية في نوافذ وأبواب uPVC، يمكنك اتباع الخطوات التالية:",
  "Look for the Schüco partner logo on the fabricator's website or any documentation they provide. This logo indicates their partnership with Schüco and their commitment to using authentic components.": "ابحث عن شعار شريك Schüco على موقع الويب الخاص بالشركة المصنّعة أو أي وثائق تقدمها. يشير هذا الشعار إلى شراكتهم مع Schüco والتزامهم باستخدام المكونات الأصلية.",
  "If you're still uncertain, you can directly contact Schüco to verify the fabricator's authenticity. Schüco can confirm whether the fabricator is an authorized partner and uses genuine Schüco components in their products.": "إذا كنت لا تزال غير متأكد، فيمكنك الاتصال مباشرة بشركة Schüco للتحقق من صحة الشركة المصنّعة. يمكن لشركة Schüco التأكد مما إذا كانت الشركة المصنعة شريكًا معتمدًا وتستخدم مكونات Schüco الأصلية في منتجاتها.",
  "By taking these steps, you can be confident that you're receiving high-quality uPVC windows and doors made with authentic Schüco components.": "من خلال اتخاذ هذه الخطوات، يمكنك أن تكون واثقًا من أنك ستحصل على نوافذ وأبواب uPVC عالية الجودة مصنوعة من مكونات Schüco الأصلية.",
  "What is the installation proc,ess for Schüco uPVC windows and doors, and how long does it take?": "ما هي عملية تركيب نوافذ وأبواب Schüco uPVC وما هي المدة التي تستغرقها؟",
  "The installation process for Schüco uPVC windows and doors typically involves the following steps, although the exact process may vary depending on the specific project requirements:": "تتضمن عملية تركيب نوافذ وأبواب Schüco uPVC عادةً الخطوات التالية، على الرغم من أن العملية الدقيقة قد تختلف وفقًا لمتطلبات المشروع المحددة:",
  "Site assessment: Before the installation begins, a technician will visit your property to take accurate measurements and assess the site conditions, ensuring that the windows and doors are correctly sized and customized to fit your home.": "تقييم الموقع: قبل بدء التثبيت، سيقوم فني بزيارة الممتلكات الخاصة بك لأخذ قياسات دقيقة وتقييم ظروف الموقع، والتأكد من أن النوافذ والأبواب ذات حجم صحيح ومخصصة لتناسب منزلك.",
  "Manufacturing: Once the measurements are taken and the design is finalized, the Schüco uPVC windows and doors will be custom-manufactured according to your specifications.": "التصنيع: بمجرد أخذ القياسات والانتهاء من التصميم، سيتم تصنيع نوافذ وأبواب Schüco uPVC خصيصًا وفقًا لمواصفاتك.",
  "Delivery: The finished windows and doors will be delivered to your property, ready for installation.": "التسليم: سيتم تسليم النوافذ والأبواب النهائية إلى الممتلكات الخاصة بك، وتكون جاهزة للتركيب.",
  "Installation: The Schüco uPVC windows and doors will be securely installed in the openings, ensuring proper alignment, leveling, and sealing to provide optimal performance.": "التثبيت: سيتم تثبيت نوافذ وأبواب Schüco uPVC بشكل آمن في الفتحات، مما يضمن المحاذاة الصحيحة والتسوية والختم لتوفير الأداء الأمثل.",
  "Finishing touches: The installation team will complete any necessary trim work, caulking, and sealing to ensure a polished appearance and effective weatherproofing.": "اللمسات الأخيرة: سيقوم فريق التركيب بإكمال أي أعمال تقليم ضرورية، والسد، والختم لضمان المظهر المصقول والمقاومة الفعالة للعوامل الجوية.",
  "Cleanup: After the installation is complete, the team will clean up the work area, removing any debris and leaving your home neat and tidy.": "التنظيف: بعد اكتمال التثبيت، سيقوم الفريق بتنظيف منطقة العمل وإزالة أي حطام وترك منزلك أنيقًا ومرتبًا.",
  "The installation time for Sc,hüco uPVC windows and doors can vary depending on the size of the project, the number of windows and doors being installed, and any unforeseen challenges that may arise during the process. Generally, our installation process takes between 2 to 5 weeks, depending on the project size. Your installation team will provide you with a more accurate estimate based on your specific project.": "يمكن أن يختلف وقت تركيب نوافذ وأبواب Schüco uPVC اعتمادًا على حجم المشروع وعدد النوافذ والأبواب التي يتم تركيبها وأي تحديات غير متوقعة قد تنشأ أثناء العملية. بشكل عام، تستغرق عملية التثبيت لدينا ما بين 2 إلى 5 أسابيع، اعتمادًا على حجم المشروع. سيزودك فريق التثبيت الخاص بك بتقدير أكثر دقة بناءً على مشروعك المحدد.",
  "What is the U-value, and why is it important for my windows and doors?": "ما هي قيمة U، ولماذا هي مهمة بالنسبة للنوافذ والأبواب؟",
  "The U-value, also known as thermal transmittance, is a measure of how effective a building material is as an insulator. It indicates the rate at which heat is transferred through a material, such as the glass and frames of your windows and doors. U-values are typically expressed in watts per square meter Kelvin (W/m²K), with lower values representing better insulation performance.": "قيمة U، المعروفة أيضًا باسم النفاذية الحرارية، هي مقياس لمدى فعالية مادة البناء كعازل. فهو يشير إلى معدل انتقال الحرارة عبر مادة ما، مثل الزجاج وإطارات النوافذ والأبواب. يتم التعبير عن قيم U عادةً بالواط لكل متر مربع كلفن (W/m²K)، حيث تمثل القيم الأقل أداء عزل أفضل.",
  "U-values are important for windows and doors for several reasons:": "تعتبر قيم U مهمة للنوافذ والأبواب لعدة أسباب:",
  "Energy efficiency: Windows and doors with lower U-values provide better insulation, reducing heat transfer between the indoors and outdoors. This means less heat is lost from your home during colder months and less heat enters during warmer months, resulting in lower energy consumption and costs for heating and cooling.": "كفاءة استخدام الطاقة: توفر النوافذ والأبواب ذات قيم U المنخفضة عزلًا أفضل، مما يقلل من انتقال الحرارة بين الداخل والخارج. وهذا يعني فقدان قدر أقل من الحرارة من منزلك خلال الأشهر الباردة ودخول حرارة أقل خلال الأشهر الأكثر دفئًا، مما يؤدي إلى انخفاض استهلاك الطاقة وتكاليف التدفئة والتبريد.",
  "Comfort: Improved insulation offered by windows and doors with lower U-values helps to maintain a more consistent indoor temperature, contributing to a more comfortable living environment.": "الراحة: يساعد العزل المحسن الذي توفره النوافذ والأبواب ذات قيم U المنخفضة في الحفاظ على درجة حرارة داخلية أكثر اتساقًا، مما يساهم في توفير بيئة معيشية أكثر راحة.",
  "Condensation control: Better insulated windows and doors reduce the likelihood of condensation forming on the interior surfaces, which can help prevent mold growth and damage to your property.": "التحكم في التكثيف: تعمل النوافذ والأبواب المعزولة بشكل أفضل على تقليل احتمالية تكوين التكثيف على الأسطح الداخلية، مما يمكن أن يساعد في منع نمو العفن وإلحاق الضرر بالممتلكات الخاصة بك.",
  "Building regulations and standards: Many countries have energy efficiency standards and building regulations that require windows and doors to meet specific U-value thresholds. Installing windows and doors with appropriate U-values ensures compliance with these requirements.": "لوائح ومعايير البناء: لدى العديد من البلدان معايير كفاءة الطاقة ولوائح البناء التي تتطلب أن تلبي النوافذ والأبواب عتبات محددة للقيمة U. إن تركيب النوافذ والأبواب بقيم U المناسبة يضمن الامتثال لهذه المتطلبات.",
  "When selecting windows and doors for your home, it's essential to consider the U-value to ensure that you are getting a product that offers optimal energy efficiency, comfort, and compliance with building regulations.": "عند اختيار النوافذ والأبواب لمنزلك، من الضروري مراعاة قيمة U لضمان حصولك على منتج يوفر كفاءة الطاقة المثالية والراحة والامتثال للوائح البناء.",
  "Can Schüco uPVC windows and doors be customized to match my home's design?": "هل يمكن تخصيص نوافذ وأبواب Schüco uPVC لتتناسب مع تصميم منزلي؟",
  "Yes, Schüco uPVC windows and doors can be customized to match your home's design. Schüco offers a wide range of options to ensure that their products blend seamlessly with your home's aesthetic and meet your specific requirements. Some of the customization options include:": "نعم، يمكن تخصيص نوافذ وأبواب Schüco uPVC لتتناسب مع تصميم منزلك. تقدم Schüco مجموعة واسعة من الخيارات للتأكد من أن منتجاتها تمتزج بسلاسة مع جمالية منزلك وتلبي متطلباتك المحددة. تتضمن بعض خيارات التخصيص ما يلي:",
  "Style and design: Schüco uPVC windows and doors are available in various styles, including casement, tilt and turn, sliding, and bi-fold, among others. This variety allows you to choose the best option to complement your home's architecture and design preferences.": "الأسلوب والتصميم: تتوفر نوافذ وأبواب Schüco uPVC بأنماط مختلفة، بما في ذلك الأبواب، والإمالة والدوران، والانزلاق، والطي المزدوج، وغيرها. يتيح لك هذا التنوع اختيار الخيار الأفضل لاستكمال تفضيلات الهندسة المعمارية والتصميم في منزلك.",
  "Color and finish: Schüco uPVC windows and doors come in an extensive range of colors and finishes. You can select from a spectrum of solid colors, woodgrain finishes, or even metallic effects to create the desired look that harmonizes with your home's exterior and interior design.": "اللون والتشطيب: تأتي نوافذ وأبواب Schüco uPVC بمجموعة واسعة من الألوان والتشطيبات. يمكنك الاختيار من بين مجموعة من الألوان الصلبة، أو التشطيبات الخشبية، أو حتى التأثيرات المعدنية لإنشاء المظهر المطلوب الذي يتناغم مع التصميم الخارجي والداخلي لمنزلك.",
  "Glass options: Keystone offers a selection of high-performance glass options for use with Schüco uPVC windows and doors. More thickness can be provided for further noise reduction if needed. As these are high-performance glass options, Low-E glass is not required. You can also choose from various decorative glass options like frosted, tinted, or patterned glass to enhance privacy or add a unique touch to your home.": "خيارات الزجاج: توفر Keystone مجموعة مختارة من خيارات الزجاج عالية الأداء للاستخدام مع نوافذ وأبواب Schüco uPVC. يمكن توفير المزيد من السماكة لمزيد من تقليل الضوضاء إذا لزم الأمر. نظرًا لأن هذه خيارات زجاجية عالية الأداء، فلا يلزم استخدام زجاج منخفض الانبعاث. يمكنك أيضًا الاختيار من بين خيارات الزجاج المزخرف المتنوعة مثل الزجاج المصنفر أو الملون أو المزخرف لتعزيز الخصوصية أو إضافة لمسة فريدة لمنزلك.",
  "Hardware and accessories: Schüco provides a variety of hardware options, including handles, hinges, and locking mechanisms, in different styles and finishes to match your preferences and ensure the security and functionality of your windows and doors.": "الأجهزة والملحقات: توفر Schüco مجموعة متنوعة من خيارات الأجهزة، بما في ذلك المقابض والمفصلات وآليات القفل، بأنماط وتشطيبات مختلفة لتتناسب مع تفضيلاتك وتضمن أمان النوافذ والأبواب ووظائفها.",
  "By working closely with your Schüco fabricator, you can customize your uPVC windows and doors to achieve the perfect combination of style, functionality, and performance that complements your home's design.": "من خلال العمل بشكل وثيق مع مصنع Schüco الخاص بك، يمكنك تخصيص نوافذ وأبواب uPVC لتحقيق مزيج مثالي من الأسلوب والوظيفة والأداء الذي يكمل تصميم منزلك.",
  "Do you offer a warranty on Schüco uPVC windows and doors?": "هل تقدمون ضمانًا على نوافذ وأبواب Schüco uPVC؟",
  "Yes, we offer a warranty on Schüco uPVC windows and doors to ensure your peace of mind and confidence in the quality and performance of our products.": "نعم، نحن نقدم ضمانًا على نوافذ وأبواب Schüco uPVC لضمان راحة بالك والثقة في جودة وأداء منتجاتنا.",
  "For white uPVC window and door profiles, we provide a 10-year warranty, which covers any defects in materials or workmanship that may arise during this period.": "بالنسبة لنوافذ وأبواب uPVC البيضاء، نقدم ضمانًا لمدة 10 سنوات، والذي يغطي أي عيوب في المواد أو التصنيع قد تنشأ خلال هذه الفترة.",
  "For foiled (color) uPVC window and door profiles, we offer a 5-year warranty, which also covers defects in materials or workmanship.": "For foiled (color) uPVC window and door profiles, we offer a 5-year warranty, which also covers defects in materials or workmanship.",
  "For hardware and accessories, we provide a 1-year warranty, which covers defects in materials or workmanship that may arise during this period.": "بالنسبة للأجهزة والملحقات، نقدم ضمانًا لمدة عام واحد، والذي يغطي العيوب في المواد أو التصنيع التي قد تنشأ خلال هذه الفترة.",
  "For glass double glazed units (DGU), we offer a 5-year warranty, covering defects in materials or workmanship that may arise during this period.": "بالنسبة لوحدات الزجاج المزدوج (DGU)، نقدم ضمانًا لمدة 5 سنوات، يغطي العيوب في المواد أو التصنيع التي قد تنشأ خلال هذه الفترة.",
  "1": "واحد",
  "2": "إثنان",
  "3": "ثلاثة",
  "4": "أربعة",
  "5": "خمسة",
  "6": "ستة",
  "7": "سبعة",
  "8": "ثمانية",
  "What is the installation process for Schüco uPVC windows and doors, and how long does it take?": "ما هي عملية تركيب نوافذ وأبواب Schüco uPVC وما هي المدة التي تستغرقها؟",
  "Ready to Transform Your Home?": "هل أنت مستعد لتحويل منزلك؟",
  "Let's Get Started!": "هيا بنا نبدأ!",
  "We're excited to help you start your home transformation journey. Fill in the form below to request your free estimate. One of our skilled engineers will get in touch with you to discuss your needs and provide a detailed quote.": "نحن متحمسون لمساعدتك في بدء رحلة تحويل منزلك. املأ النموذج أدناه لطلب تقديرك المجاني. سيتواصل معك أحد مهندسينا المهرة لمناقشة احتياجاتك وتقديم عرض أسعار تفصيلي.",
  "Your Name": "اسمك",
  "Email Address": "عنوان البريد الإلكتروني",
  "Contact Number": "رقم الاتصال",
  "Submit Your Request": "أرسل طلبك",
  "Join Our Growing Family of Satisfied Homeowners!": "انضم إلى عائلتنا المتنامية من أصحاب المنازل الراضين.",
  "Sound Proof": "دليل على الصوت",
  "Weather Proof": "دليل على الطقس",
  "Near to Zero Maintenance": "بالقرب من الصيانة الصفرية",
  "Get Your Free Estimate Today": "احصل على تقديرك المجاني اليوم",
  "Receive a detailed quote after your request": "احصل على عرض أسعار مفصل بعد طلبك",
  "No payment required today": "لا حاجة للدفع اليوم",
  "We stand by the quality of our profiles with a 10-year warranty.": "نحن نلتزم بجودة ملفاتنا الشخصية مع ضمان لمدة 10 سنوات.",
  "10-Year Warranty": "ضمان 10 سنوات",
  "Go only for trusted German brands who offer durable, energy-efficient, and stylish products": "اختر فقط العلامات التجارية الألمانية الموثوقة التي تقدم منتجات متينة وموفرة للطاقة وأنيقة"
}
